#### OnShutdown Method

---

|  |
| --- |
| IEntryPoint Interface   See Also |

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` void OnShutdown() ``` |

| Visual Basic |
| --- |
| ``` Sub OnShutdown ``` |

| Visual C++ |
| --- |
| ``` void OnShutdown() ``` |

# See Also

IEntryPoint Interface

Autodesk.Revit.DB.Macros Namespace